#include <PopetDS18.h>

void setup() {
  DS18_reset(); // инициализация чипа
  DS18_SetResolution(12); // выставляем разрешения, от 9 до 12 бит
  // для 9 бит ждем 94~ мс
  // для 10 бит ждем 188~ мс
  // для 11 бит ждем 375~ мс
  // для 12 бит ждем 750~ мс
}

void loop() {
  DS18getRaw(); // Говорим датчику начать измерения
  _delay_ms(800);
  int16_t raw = DS18getTemp(); // читаем измерянную температуру
  uint8_t negative = 0; // если negative = 0, значит температура отрицательная
  if (raw < 0) {
    negative = 1;
    raw = -raw;
  }
  int16_t whole = raw >> 4; // сдвигаем на 4 бита и получаем целое число, аналогия делению на 16
  uint8_t frac_units = raw & 0x0F; // берем только 4 младших бита - это наша дробная часть
  uint16_t centideg = whole * 100 + frac_units * 25 / 4; // собираем итоговое число в формате ХХ.ХХ
  _delay_ms(200);
}

// Замер веса - Использовал Arduino ide 2.3.10 на ардуино нано, результат:
// Пустой скетч ардуино весит 444 байт учтите это, PopetDS18.h заняла 308 байт, итого 752 флеш занимает данный пример BasicTemp
// результат получен в моих условиях компиляции и может отличаться от версии компилятора, Arduino core и используемого кода.
