#include <PopetDS18.h>

void setup() {
  Serial.begin(9600);
  DS18_reset(); // Инициализация и сброс
  DS18_SetResolution(12); // выставляем желаемое разрешения
  // для 12 бит задержка 750~ мс
  // для 11 бит задержка 375~ мс
  // для 10 бит задержка 188~ мс
  // для 9 бит задержка 94~ мс
}

void loop() {
  DS18getRaw(); // отправляем запрос на измерения температуры
  _delay_ms(800); // ждем измерения
  int16_t raw = DS18getTemp(); // переменной raw забираем измерянную температуру с датчика
  float Temp = raw * 0.0625;
  Serial.print("Temperature: ");
  Serial.println(Temp);
  _delay_ms(200);
}
// Замер веса - Использовал Arduino ide 2.3.10 на ардуино нано, результат:
// Пустой скетч весит 444 байт учтите это, Serial Monitor занимает 1140 байт, Флоат математика 1852 байта, PopetDS18.h заняла 308 байт, итого 3300 флеш занимает данный пример floatTemp
// результат получен в моих условиях компиляции и может отличаться от версии компилятора, Arduino core и используемого кода.